In [2]:
import pandas as pd
import numpy as np

In [2]:
from pandas import Series,DataFrame

In [4]:
obj=pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
obj2['a']

-5

In [12]:
obj2['d']

4

In [13]:
obj2[['c','d','a']]

c    3
d    4
a   -5
dtype: int64

In [14]:
obj2[obj2>2]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [20]:
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [21]:
obj3=pd.Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
states=['California','Ohio','Oregon','Texas']

如果只传入一个字典，则结果Series中的索引就是原字典的键（有序排列）。

In [24]:
obj4=pd.Series(sdata,index=states)

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [33]:
obj4.name='population'
obj4.index.name='state'

In [34]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [35]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [36]:
obj.index=['a','b','c','d']

In [37]:
obj

a    4
b    7
c   -5
d    3
dtype: int64

In [3]:
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [42]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [45]:
frame.index=['one','two','three','four','five','six']

In [46]:
frame

        state  year  pop
one      Ohio  2000  1.5
two      Ohio  2001  1.7
three    Ohio  2002  3.6
four   Nevada  2001  2.4
five   Nevada  2002  2.9
six    Nevada  2003  3.2

In [47]:
frame.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [48]:
frame['debt']=16.5

In [49]:
frame

        state  year  pop  debt
one      Ohio  2000  1.5  16.5
two      Ohio  2001  1.7  16.5
three    Ohio  2002  3.6  16.5
four   Nevada  2001  2.4  16.5
five   Nevada  2002  2.9  16.5
six    Nevada  2003  3.2  16.5

In [50]:
frame[1]=16.5

In [51]:
frame.1

SyntaxError: invalid syntax (<ipython-input-51-958444a6544c>, line 1)

笔记：IPython提供了类似属性的访问（即frame2.year）和tab补全。
frame2[column]适用于任何列的名，但是frame2.column只有在列名是一个合理的Python变量名时才适用。

In [52]:
frame.loc['three']

state    Ohio
year     2002
pop       3.6
debt     16.5
1        16.5
Name: three, dtype: object

In [53]:
frame.debt=np.arange(6.)

In [54]:
frame

        state  year  pop  debt     1
one      Ohio  2000  1.5   0.0  16.5
two      Ohio  2001  1.7   1.0  16.5
three    Ohio  2002  3.6   2.0  16.5
four   Nevada  2001  2.4   3.0  16.5
five   Nevada  2002  2.9   4.0  16.5
six    Nevada  2003  3.2   5.0  16.5

In [55]:
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [56]:
frame['debt']=val

In [57]:
frame

        state  year  pop  debt     1
one      Ohio  2000  1.5   NaN  16.5
two      Ohio  2001  1.7  -1.2  16.5
three    Ohio  2002  3.6   NaN  16.5
four   Nevada  2001  2.4  -1.5  16.5
five   Nevada  2002  2.9  -1.7  16.5
six    Nevada  2003  3.2   NaN  16.5

In [58]:
frame['eartern']=frame.state=='Ohio'

In [59]:
frame

        state  year  pop  debt     1  eartern
one      Ohio  2000  1.5   NaN  16.5     True
two      Ohio  2001  1.7  -1.2  16.5     True
three    Ohio  2002  3.6   NaN  16.5     True
four   Nevada  2001  2.4  -1.5  16.5    False
five   Nevada  2002  2.9  -1.7  16.5    False
six    Nevada  2003  3.2   NaN  16.5    False

In [60]:
pop={'Nevada':{2000:2.4,2001:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
pop

{'Nevada': {2000: 2.4, 2001: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [61]:
frame3=pd.DataFrame(pop)

In [62]:
frame3

      Nevada  Ohio
2000     2.4   1.5
2001     2.9   1.7
2002     NaN   3.6

In [66]:
pdata={'Ohio':frame3['Ohio'][:2],'Nevada':frame3['Nevada'][:-1]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     2.4
2001   1.7     2.9

In [67]:
frame3.values

array([[2.4, 1.5],
       [2.9, 1.7],
       [nan, 3.6]])

In [68]:
frame3.index.name='year'

In [69]:
frame3.columns.name='state'

In [70]:
frame3

state  Nevada  Ohio
year
2000      2.4   1.5
2001      2.9   1.7
2002      NaN   3.6

In [71]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [72]:
obj2=obj.reindex(['a','b','c','d','e'])

In [73]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [75]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [77]:
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [78]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [79]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [82]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [84]:
data.drop('Ohio',inplace=True)
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

切片方法与numpy类似，但又有所不同
：切片
只不过可能用的不是整数而是index中的变量
但用变量时最大的不同点在于，末端是包含的
整数切片时仍然不包含

In [87]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [88]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [89]:
obj[2:3]

c    2.0
dtype: float64

选取特定的行或列loc,iloc
用方括号

In [10]:
data=pd.DataFrame(data)
data.index=data.state
data

         state  year  pop
state
Ohio      Ohio  2000  1.5
Ohio      Ohio  2001  1.7
Ohio      Ohio  2002  3.6
Nevada  Nevada  2001  2.4
Nevada  Nevada  2002  2.9
Nevada  Nevada  2003  3.2

In [12]:
data.loc['Ohio',['state','year']]

      state  year
state
Ohio   Ohio  2000
Ohio   Ohio  2001
Ohio   Ohio  2002

In [14]:
data.iloc[2,[2,0,1]]

pop       3.6
state    Ohio
year     2002
Name: Ohio, dtype: object

In [15]:
data.iloc[2]

state    Ohio
year     2002
pop       3.6
Name: Ohio, dtype: object

In [16]:
s1=pd.Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])

In [17]:
s2=pd.Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [18]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [19]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [20]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [24]:
df1=pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2=pd.DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
df1,df2

(            b    c    d
 Ohio      0.0  1.0  2.0
 Texas     3.0  4.0  5.0
 Colorado  6.0  7.0  8.0,           b     d     e
 Utah    0.0   1.0   2.0
 Ohio    3.0   4.0   5.0
 Texas   6.0   7.0   8.0
 Oregon  9.0  10.0  11.0)

In [25]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [26]:
f=lambda x:x.max()-x.min()

In [28]:
df1.apply(f)

b    6.0
c    6.0
d    6.0
dtype: float64

In [29]:
df1.apply(f,axis='columns')

Ohio        2.0
Texas       2.0
Colorado    2.0
dtype: float64

In [30]:
df1.sum()

b     9.0
c    12.0
d    15.0
dtype: float64

排序：
sort_index()
sort_values()

In [31]:
df1.sum(axis='columns')

Ohio         3.0
Texas       12.0
Colorado    21.0
dtype: float64

In [33]:
df1.sum(axis='rows')

b     9.0
c    12.0
d    15.0
dtype: float64

In [34]:
obj=pd.Series(['a','a','b','c','c','d'])
obj.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [35]:
obj.value_counts()

c    2
a    2
b    1
d    1
dtype: int64

In [37]:
df=df1+df2
df

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [38]:
df.apply(pd.value_counts).fillna(0)

        b    c    d    e
3.0   1.0  0.0  0.0  0.0
6.0   0.0  0.0  1.0  0.0
9.0   1.0  0.0  0.0  0.0
12.0  0.0  0.0  1.0  0.0